is1200-example-projects/mcb32tools/headers/proc/p32mz1024ech124.h
extern volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs")));
extern volatile unsigned int        IEC0CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IEC0SET __attribute__((section("sfrs")));
extern volatile unsigned int        IEC0INV __attribute__((section("sfrs")));
extern volatile unsigned int        IEC1 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned T7IE:1;
    unsigned IC7EIE:1;
    unsigned IC7IE:1;
    unsigned OC7IE:1;
    unsigned T8IE:1;
    unsigned IC8EIE:1;
    unsigned IC8IE:1;
    unsigned OC8IE:1;
    unsigned T9IE:1;
    unsigned IC9EIE:1;
    unsigned IC9IE:1;
    unsigned OC9IE:1;
    unsigned AD1IE:1;
    unsigned :1;
    unsigned AD1DC1IE:1;
    unsigned AD1DC2IE:1;
    unsigned AD1DC3IE:1;
    unsigned AD1DC4IE:1;
    unsigned AD1DC5IE:1;
    unsigned AD1DC6IE:1;
    unsigned AD1DF1IE:1;
    unsigned AD1DF2IE:1;
    unsigned AD1DF3IE:1;
    unsigned AD1DF4IE:1;
    unsigned AD1DF5IE:1;
    unsigned AD1DF6IE:1;
    unsigned :1;
    unsigned AD1D0IE:1;
    unsigned AD1D1IE:1;
    unsigned AD1D2IE:1;
    unsigned AD1D3IE:1;
    unsigned AD1D4IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC1bits_t;
extern volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs")));
extern volatile unsigned int        IEC1CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IEC1SET __attribute__((section("sfrs")));
extern volatile unsigned int        IEC1INV __attribute__((section("sfrs")));
extern volatile unsigned int        IEC2 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D5IE:1;
    unsigned AD1D6IE:1;
    unsigned AD1D7IE:1;
    unsigned AD1D8IE:1;
    unsigned AD1D9IE:1;
    unsigned AD1D10IE:1;
    unsigned AD1D11IE:1;
    unsigned AD1D12IE:1;
    unsigned AD1D13IE:1;
    unsigned AD1D14IE:1;
    unsigned AD1D15IE:1;
    unsigned AD1D16IE:1;
    unsigned AD1D17IE:1;
    unsigned AD1D18IE:1;
    unsigned AD1D19IE:1;
    unsigned AD1D20IE:1;
    unsigned AD1D21IE:1;
    unsigned AD1D22IE:1;
    unsigned AD1D23IE:1;
    unsigned AD1D24IE:1;
    unsigned AD1D25IE:1;
    unsigned AD1D26IE:1;
    unsigned AD1D27IE:1;
    unsigned AD1D28IE:1;
    unsigned AD1D29IE:1;
    unsigned AD1D30IE:1;
    unsigned AD1D31IE:1;
    unsigned AD1D32IE:1;
    unsigned AD1D33IE:1;
    unsigned AD1D34IE:1;
    unsigned AD1D35IE:1;
    unsigned AD1D36IE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC2bits_t;
extern volatile __IEC2bits_t IEC2bits __asm__ ("IEC2") __attribute__((section("sfrs")));
extern volatile unsigned int        IEC2CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IEC2SET __attribute__((section("sfrs")));
extern volatile unsigned int        IEC2INV __attribute__((section("sfrs")));
extern volatile unsigned int        IEC3 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned AD1D37IE:1;
    unsigned AD1D38IE:1;
    unsigned AD1D39IE:1;
    unsigned AD1D40IE:1;
    unsigned AD1D41IE:1;
    unsigned AD1D42IE:1;
    unsigned AD1D43IE:1;
    unsigned AD1D44IE:1;
    unsigned CPCIE:1;
    unsigned CFDCIE:1;
    unsigned SBIE:1;
    unsigned :2;
    unsigned SPI1EIE:1;
    unsigned SPI1RXIE:1;
    unsigned SPI1TXIE:1;
    unsigned U1EIE:1;
    unsigned U1RXIE:1;
    unsigned U1TXIE:1;
    unsigned I2C1BIE:1;
    unsigned I2C1SIE:1;
    unsigned I2C1MIE:1;
    unsigned CNAIE:1;
    unsigned CNBIE:1;
    unsigned CNCIE:1;
    unsigned CNDIE:1;
    unsigned CNEIE:1;
    unsigned CNFIE:1;
    unsigned CNGIE:1;
    unsigned CNHIE:1;
    unsigned CNJIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC3bits_t;
extern volatile __IEC3bits_t IEC3bits __asm__ ("IEC3") __attribute__((section("sfrs")));
extern volatile unsigned int        IEC3CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IEC3SET __attribute__((section("sfrs")));
extern volatile unsigned int        IEC3INV __attribute__((section("sfrs")));
extern volatile unsigned int        IEC4 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned PMPIE:1;
    unsigned PMPEIE:1;
    unsigned CMP1IE:1;
    unsigned CMP2IE:1;
    unsigned USBIE:1;
    unsigned USBDMAIE:1;
    unsigned DMA0IE:1;
    unsigned DMA1IE:1;
    unsigned DMA2IE:1;
    unsigned DMA3IE:1;
    unsigned DMA4IE:1;
    unsigned DMA5IE:1;
    unsigned DMA6IE:1;
    unsigned DMA7IE:1;
    unsigned SPI2EIE:1;
    unsigned SPI2RXIE:1;
    unsigned SPI2TXIE:1;
    unsigned U2EIE:1;
    unsigned U2RXIE:1;
    unsigned U2TXIE:1;
    unsigned I2C2BIE:1;
    unsigned I2C2SIE:1;
    unsigned I2C2MIE:1;
    unsigned CAN1IE:1;
    unsigned CAN2IE:1;
    unsigned ETHIE:1;
    unsigned SPI3EIE:1;
    unsigned SPI3RXIE:1;
    unsigned SPI3TXIE:1;
    unsigned U3EIE:1;
    unsigned U3RXIE:1;
    unsigned U3TXIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC4bits_t;
extern volatile __IEC4bits_t IEC4bits __asm__ ("IEC4") __attribute__((section("sfrs")));
extern volatile unsigned int        IEC4CLR __attribute__((section("sfrs")));
extern volatile unsigned int        IEC4SET __attribute__((section("sfrs")));
extern volatile unsigned int        IEC4INV __attribute__((section("sfrs")));
extern volatile unsigned int        IEC5 __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned I2C3BIE:1;
    unsigned I2C3SIE:1;
    unsigned I2C3MIE:1;
    unsigned SPI4EIE:1;
    unsigned SPI4RXIE:1;
    unsigned SPI4TXIE:1;
    unsigned RTCCIE:1;
    unsigned FCEIE:1;
    unsigned PREIE:1;
    unsigned SQI1IE:1;
    unsigned U4EIE:1;
    unsigned U4RXIE:1;
    unsigned U4TXIE:1;
    unsigned I2C4BIE:1;
    unsigned I2C4SIE:1;
    unsigned I2C4MIE:1;
    unsigned SPI5EIE:1;
    unsigned SPI5RXIE:1;
    unsigned SPI5TXIE:1;
    unsigned U5EIE:1;
    unsigned U5RXIE:1;
    unsigned U5TXIE:1;
    unsigned I2C5BIE:1;
    unsigned I2C5SIE:1;
    unsigned I2C5MIE:1;
    unsigned SPI6IE:1;
    unsigned SPI6RXIE:1;
    unsigned SPI6TXIE:1;
    unsigned U6EIE:1;
    unsigned U6RXIE:1;
    unsigned U6TXIE:1;
  };
  struct {
    unsigned w:32;
  };
} __IEC5bits_t;
