is1200-example-projects/mcb32tools/headers/proc/p32mz1024ech124.h
#define _NVMBWP_UBWP4_POSITION                   0x00000004
#define _NVMBWP_UBWP4_MASK                       0x00000010
#define _NVMBWP_UBWP4_LENGTH                     0x00000001

#define _NVMBWP_UBWPULOCK_POSITION               0x00000007
#define _NVMBWP_UBWPULOCK_MASK                   0x00000080
#define _NVMBWP_UBWPULOCK_LENGTH                 0x00000001

#define _NVMBWP_LBWP0_POSITION                   0x00000008
#define _NVMBWP_LBWP0_MASK                       0x00000100
#define _NVMBWP_LBWP0_LENGTH                     0x00000001

#define _NVMBWP_LBWP1_POSITION                   0x00000009
#define _NVMBWP_LBWP1_MASK                       0x00000200
#define _NVMBWP_LBWP1_LENGTH                     0x00000001

#define _NVMBWP_LBWP2_POSITION                   0x0000000A
#define _NVMBWP_LBWP2_MASK                       0x00000400
#define _NVMBWP_LBWP2_LENGTH                     0x00000001

#define _NVMBWP_LBWP3_POSITION                   0x0000000B
#define _NVMBWP_LBWP3_MASK                       0x00000800
#define _NVMBWP_LBWP3_LENGTH                     0x00000001

#define _NVMBWP_LBWP4_POSITION                   0x0000000C
#define _NVMBWP_LBWP4_MASK                       0x00001000
#define _NVMBWP_LBWP4_LENGTH                     0x00000001

#define _NVMBWP_LBWPULOCK_POSITION               0x0000000F
#define _NVMBWP_LBWPULOCK_MASK                   0x00008000
#define _NVMBWP_LBWPULOCK_LENGTH                 0x00000001

#define _WDTCON_WDTWINEN_POSITION                0x00000001
#define _WDTCON_WDTWINEN_MASK                    0x00000002
#define _WDTCON_WDTWINEN_LENGTH                  0x00000001

#define _WDTCON_SWDTPS_POSITION                  0x00000002
#define _WDTCON_SWDTPS_MASK                      0x0000007C
#define _WDTCON_SWDTPS_LENGTH                    0x00000005

#define _WDTCON_ON_POSITION                      0x0000000F
#define _WDTCON_ON_MASK                          0x00008000
#define _WDTCON_ON_LENGTH                        0x00000001

#define _WDTCON_WDTCLRKEY_POSITION               0x00000010
#define _WDTCON_WDTCLRKEY_MASK                   0xFFFF0000
#define _WDTCON_WDTCLRKEY_LENGTH                 0x00000010

#define _WDTCON_SWDTPS0_POSITION                 0x00000002
#define _WDTCON_SWDTPS0_MASK                     0x00000004
#define _WDTCON_SWDTPS0_LENGTH                   0x00000001

#define _WDTCON_SWDTPS1_POSITION                 0x00000003
#define _WDTCON_SWDTPS1_MASK                     0x00000008
#define _WDTCON_SWDTPS1_LENGTH                   0x00000001

#define _WDTCON_SWDTPS2_POSITION                 0x00000004
#define _WDTCON_SWDTPS2_MASK                     0x00000010
#define _WDTCON_SWDTPS2_LENGTH                   0x00000001

#define _WDTCON_SWDTPS3_POSITION                 0x00000005
#define _WDTCON_SWDTPS3_MASK                     0x00000020
#define _WDTCON_SWDTPS3_LENGTH                   0x00000001

#define _WDTCON_SWDTPS4_POSITION                 0x00000006
#define _WDTCON_SWDTPS4_MASK                     0x00000040
#define _WDTCON_SWDTPS4_LENGTH                   0x00000001

#define _WDTCON_WDTCLRKEY0_POSITION              0x00000010
#define _WDTCON_WDTCLRKEY0_MASK                  0x00010000
#define _WDTCON_WDTCLRKEY0_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY1_POSITION              0x00000011
#define _WDTCON_WDTCLRKEY1_MASK                  0x00020000
#define _WDTCON_WDTCLRKEY1_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY2_POSITION              0x00000012
#define _WDTCON_WDTCLRKEY2_MASK                  0x00040000
#define _WDTCON_WDTCLRKEY2_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY3_POSITION              0x00000013
#define _WDTCON_WDTCLRKEY3_MASK                  0x00080000
#define _WDTCON_WDTCLRKEY3_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY4_POSITION              0x00000014
#define _WDTCON_WDTCLRKEY4_MASK                  0x00100000
#define _WDTCON_WDTCLRKEY4_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY5_POSITION              0x00000015
#define _WDTCON_WDTCLRKEY5_MASK                  0x00200000
#define _WDTCON_WDTCLRKEY5_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY6_POSITION              0x00000016
#define _WDTCON_WDTCLRKEY6_MASK                  0x00400000
#define _WDTCON_WDTCLRKEY6_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY7_POSITION              0x00000017
#define _WDTCON_WDTCLRKEY7_MASK                  0x00800000
#define _WDTCON_WDTCLRKEY7_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY8_POSITION              0x00000018
#define _WDTCON_WDTCLRKEY8_MASK                  0x01000000
#define _WDTCON_WDTCLRKEY8_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY9_POSITION              0x00000019
#define _WDTCON_WDTCLRKEY9_MASK                  0x02000000
#define _WDTCON_WDTCLRKEY9_LENGTH                0x00000001

#define _WDTCON_WDTCLRKEY10_POSITION             0x0000001A
#define _WDTCON_WDTCLRKEY10_MASK                 0x04000000
#define _WDTCON_WDTCLRKEY10_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY11_POSITION             0x0000001B
#define _WDTCON_WDTCLRKEY11_MASK                 0x08000000
#define _WDTCON_WDTCLRKEY11_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY12_POSITION             0x0000001C
#define _WDTCON_WDTCLRKEY12_MASK                 0x10000000
#define _WDTCON_WDTCLRKEY12_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY13_POSITION             0x0000001D
#define _WDTCON_WDTCLRKEY13_MASK                 0x20000000
#define _WDTCON_WDTCLRKEY13_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY14_POSITION             0x0000001E
#define _WDTCON_WDTCLRKEY14_MASK                 0x40000000
#define _WDTCON_WDTCLRKEY14_LENGTH               0x00000001

#define _WDTCON_WDTCLRKEY15_POSITION             0x0000001F
#define _WDTCON_WDTCLRKEY15_MASK                 0x80000000
#define _WDTCON_WDTCLRKEY15_LENGTH               0x00000001

#define _WDTCON_WDTPSTA_POSITION                 0x00000002
#define _WDTCON_WDTPSTA_MASK                     0x0000007C
#define _WDTCON_WDTPSTA_LENGTH                   0x00000005

#define _WDTCON_WDTPS_POSITION                   0x00000002
#define _WDTCON_WDTPS_MASK                       0x0000007C
#define _WDTCON_WDTPS_LENGTH                     0x00000005

#define _WDTCON_w_POSITION                       0x00000000
#define _WDTCON_w_MASK                           0xFFFFFFFF
#define _WDTCON_w_LENGTH                         0x00000020

#define _DMTCON_ON_POSITION                      0x0000000F
#define _DMTCON_ON_MASK                          0x00008000
#define _DMTCON_ON_LENGTH                        0x00000001

