is1200-example-projects/mcb32tools/headers/proc/p32mz1024ech124.h
#define _AD1FLTR1_OVRSAM_POSITION                0x0000001A
#define _AD1FLTR1_OVRSAM_MASK                    0x1C000000
#define _AD1FLTR1_OVRSAM_LENGTH                  0x00000003

#define _AD1FLTR1_AFEN_POSITION                  0x0000001F
#define _AD1FLTR1_AFEN_MASK                      0x80000000
#define _AD1FLTR1_AFEN_LENGTH                    0x00000001

#define _AD1FLTR2_FLTRDATA_POSITION              0x00000000
#define _AD1FLTR2_FLTRDATA_MASK                  0x0000FFFF
#define _AD1FLTR2_FLTRDATA_LENGTH                0x00000010

#define _AD1FLTR2_CHNLID_POSITION                0x00000010
#define _AD1FLTR2_CHNLID_MASK                    0x003F0000
#define _AD1FLTR2_CHNLID_LENGTH                  0x00000006

#define _AD1FLTR2_AFRDY_POSITION                 0x00000018
#define _AD1FLTR2_AFRDY_MASK                     0x01000000
#define _AD1FLTR2_AFRDY_LENGTH                   0x00000001

#define _AD1FLTR2_AFGIEN_POSITION                0x00000019
#define _AD1FLTR2_AFGIEN_MASK                    0x02000000
#define _AD1FLTR2_AFGIEN_LENGTH                  0x00000001

#define _AD1FLTR2_OVRSAM_POSITION                0x0000001A
#define _AD1FLTR2_OVRSAM_MASK                    0x1C000000
#define _AD1FLTR2_OVRSAM_LENGTH                  0x00000003

#define _AD1FLTR2_AFEN_POSITION                  0x0000001F
#define _AD1FLTR2_AFEN_MASK                      0x80000000
#define _AD1FLTR2_AFEN_LENGTH                    0x00000001

#define _AD1FLTR3_FLTRDATA_POSITION              0x00000000
#define _AD1FLTR3_FLTRDATA_MASK                  0x0000FFFF
#define _AD1FLTR3_FLTRDATA_LENGTH                0x00000010

#define _AD1FLTR3_CHNLID_POSITION                0x00000010
#define _AD1FLTR3_CHNLID_MASK                    0x003F0000
#define _AD1FLTR3_CHNLID_LENGTH                  0x00000006

#define _AD1FLTR3_AFRDY_POSITION                 0x00000018
#define _AD1FLTR3_AFRDY_MASK                     0x01000000
#define _AD1FLTR3_AFRDY_LENGTH                   0x00000001

#define _AD1FLTR3_AFGIEN_POSITION                0x00000019
#define _AD1FLTR3_AFGIEN_MASK                    0x02000000
#define _AD1FLTR3_AFGIEN_LENGTH                  0x00000001

#define _AD1FLTR3_OVRSAM_POSITION                0x0000001A
#define _AD1FLTR3_OVRSAM_MASK                    0x1C000000
#define _AD1FLTR3_OVRSAM_LENGTH                  0x00000003

#define _AD1FLTR3_AFEN_POSITION                  0x0000001F
#define _AD1FLTR3_AFEN_MASK                      0x80000000
#define _AD1FLTR3_AFEN_LENGTH                    0x00000001

#define _AD1FLTR4_FLTRDATA_POSITION              0x00000000
#define _AD1FLTR4_FLTRDATA_MASK                  0x0000FFFF
#define _AD1FLTR4_FLTRDATA_LENGTH                0x00000010

#define _AD1FLTR4_CHNLID_POSITION                0x00000010
#define _AD1FLTR4_CHNLID_MASK                    0x003F0000
#define _AD1FLTR4_CHNLID_LENGTH                  0x00000006

#define _AD1FLTR4_AFRDY_POSITION                 0x00000018
#define _AD1FLTR4_AFRDY_MASK                     0x01000000
#define _AD1FLTR4_AFRDY_LENGTH                   0x00000001

#define _AD1FLTR4_AFGIEN_POSITION                0x00000019
#define _AD1FLTR4_AFGIEN_MASK                    0x02000000
#define _AD1FLTR4_AFGIEN_LENGTH                  0x00000001

#define _AD1FLTR4_OVRSAM_POSITION                0x0000001A
#define _AD1FLTR4_OVRSAM_MASK                    0x1C000000
#define _AD1FLTR4_OVRSAM_LENGTH                  0x00000003

#define _AD1FLTR4_AFEN_POSITION                  0x0000001F
#define _AD1FLTR4_AFEN_MASK                      0x80000000
#define _AD1FLTR4_AFEN_LENGTH                    0x00000001

#define _AD1FLTR5_FLTRDATA_POSITION              0x00000000
#define _AD1FLTR5_FLTRDATA_MASK                  0x0000FFFF
#define _AD1FLTR5_FLTRDATA_LENGTH                0x00000010

#define _AD1FLTR5_CHNLID_POSITION                0x00000010
#define _AD1FLTR5_CHNLID_MASK                    0x003F0000
#define _AD1FLTR5_CHNLID_LENGTH                  0x00000006

#define _AD1FLTR5_AFRDY_POSITION                 0x00000018
#define _AD1FLTR5_AFRDY_MASK                     0x01000000
#define _AD1FLTR5_AFRDY_LENGTH                   0x00000001

#define _AD1FLTR5_AFGIEN_POSITION                0x00000019
#define _AD1FLTR5_AFGIEN_MASK                    0x02000000
#define _AD1FLTR5_AFGIEN_LENGTH                  0x00000001

#define _AD1FLTR5_OVRSAM_POSITION                0x0000001A
#define _AD1FLTR5_OVRSAM_MASK                    0x1C000000
#define _AD1FLTR5_OVRSAM_LENGTH                  0x00000003

#define _AD1FLTR5_AFEN_POSITION                  0x0000001F
#define _AD1FLTR5_AFEN_MASK                      0x80000000
#define _AD1FLTR5_AFEN_LENGTH                    0x00000001

#define _AD1FLTR6_FLTRDATA_POSITION              0x00000000
#define _AD1FLTR6_FLTRDATA_MASK                  0x0000FFFF
#define _AD1FLTR6_FLTRDATA_LENGTH                0x00000010

#define _AD1FLTR6_CHNLID_POSITION                0x00000010
#define _AD1FLTR6_CHNLID_MASK                    0x003F0000
#define _AD1FLTR6_CHNLID_LENGTH                  0x00000006

#define _AD1FLTR6_AFRDY_POSITION                 0x00000018
#define _AD1FLTR6_AFRDY_MASK                     0x01000000
#define _AD1FLTR6_AFRDY_LENGTH                   0x00000001

#define _AD1FLTR6_AFGIEN_POSITION                0x00000019
#define _AD1FLTR6_AFGIEN_MASK                    0x02000000
#define _AD1FLTR6_AFGIEN_LENGTH                  0x00000001

#define _AD1FLTR6_OVRSAM_POSITION                0x0000001A
#define _AD1FLTR6_OVRSAM_MASK                    0x1C000000
#define _AD1FLTR6_OVRSAM_LENGTH                  0x00000003

#define _AD1FLTR6_AFEN_POSITION                  0x0000001F
#define _AD1FLTR6_AFEN_MASK                      0x80000000
#define _AD1FLTR6_AFEN_LENGTH                    0x00000001

#define _AD1TRG1_TRGSRC0_POSITION                0x00000000
#define _AD1TRG1_TRGSRC0_MASK                    0x0000001F
#define _AD1TRG1_TRGSRC0_LENGTH                  0x00000005

#define _AD1TRG1_TRGSRC1_POSITION                0x00000008
#define _AD1TRG1_TRGSRC1_MASK                    0x00001F00
#define _AD1TRG1_TRGSRC1_LENGTH                  0x00000005

